// Файл: app/data/mockPosts.ts

export const mockPosts = [
  {
    id: 1,
    title: "Огромная яма на дороге",
    description: "На перекрестке образовалась глубокая яма, машины портят подвеску. Нужно срочно залатать.",
    category: "Дороги",
    status: "Новая",
    author: "Айдос Н.",
    date: "28 Февраля 2026",
    lat: 50.2839, 
    lng: 57.1670,
  },
  {
    id: 2,
    title: "Не горит фонарь во дворе",
    description: "Уже неделю темно возле 5-го подъезда. Дети боятся возвращаться со школы во вторую смену.",
    category: "Освещение",
    status: "В работе",
    author: "Елена С.",
    date: "27 Февраля 2026",
    lat: 50.2880, 
    lng: 57.1550,
  },
  {
    id: 3,
    title: "Переполненные мусорные баки",
    description: "Мусоровоз не приезжал три дня. Ветер разносит мусор по всей детской площадке.",
    category: "Экология",
    status: "Решено",
    author: "Тимур Б.",
    date: "25 Февраля 2026",
    lat: 50.2790, 
    lng: 57.1700,
  }
];